# 第14篇：进阶索引
读取及修改某行，某列或者某个单元

`[col][row]`, `iloc[row, col]` 和 `loc[row, col]` 是常用的数据选择方法
* `[col][row]` 是基于列标签和行整数和索引的。
* `iloc[row, col]` 是基于整数索引的，它允许用户通过行和列的整数位置来选择数据。
* `loc[row, col]` 是基于标签索引的。这意味着你可以使用行和列的标签来选择数据。

创建数据

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    "name": ["Tom", "Bob", "Mary", "James", "Yafei"],
    "age": [18, 30, 25, 40, 20],
    "city": ["北京", "上海", "广州", "深圳", "晋城"],
    "hobby": ["篮球", "足球", "羽毛球", "读书；国学", "篮球；修己"],
}
user_info = pd.DataFrame(data=data)
user_info

    name  age city  hobby
0    Tom   18   北京     篮球
1    Bob   30   上海     足球
2   Mary   25   广州    羽毛球
3  James   40   深圳  读书；国学
4  Yafei   20   晋城  篮球；修己

## `[col][row]` 访问及修改

访问列数据

In [3]:
user_info["age"]

0    18
1    30
2    25
3    40
4    20
Name: age, dtype: int64

列切片

In [4]:
user_info[["age", "city"]]

   age city
0   18   北京
1   30   上海
2   25   广州
3   40   深圳
4   20   晋城

行切片, 不支持访问单行数据

In [5]:
user_info[1:]

    name  age city  hobby
1    Bob   30   上海     足球
2   Mary   25   广州    羽毛球
3  James   40   深圳  读书；国学
4  Yafei   20   晋城  篮球；修己

访问单元

In [6]:
user_info["age"][1]

30

访问某列的几行数据

In [7]:
user_info["age"][1:]

1    30
2    25
3    40
4    20
Name: age, dtype: int64

访问某块数据

In [8]:
user_info[["age", "city"]][1:]

   age city
1   30   上海
2   25   广州
3   40   深圳
4   20   晋城

通过属性访问

In [9]:
user_info.age

0    18
1    30
2    25
3    40
4    20
Name: age, dtype: int64

新增一列

In [10]:
user_info["gender"] = ["男", "女", "女", "男", "女"]
user_info

    name  age city  hobby gender
0    Tom   18   北京     篮球      男
1    Bob   30   上海     足球      女
2   Mary   25   广州    羽毛球      女
3  James   40   深圳  读书；国学      男
4  Yafei   20   晋城  篮球；修己      女

## `iloc[row, col]` 索引访问及修改

访问列数据

In [11]:
user_info.iloc[:, 1]

0    18
1    30
2    25
3    40
4    20
Name: age, dtype: int64

In [12]:
user_info.iloc[:, 1] = [20, 30, 25, 40, 100]
user_info

    name  age city  hobby gender
0    Tom   20   北京     篮球      男
1    Bob   30   上海     足球      女
2   Mary   25   广州    羽毛球      女
3  James   40   深圳  读书；国学      男
4  Yafei  100   晋城  篮球；修己      女

访问行数据

In [13]:
user_info.iloc[0]

name      Tom
age        20
city       北京
hobby      篮球
gender      男
Name: 0, dtype: object

In [14]:
user_info.iloc[1, :]

name      Bob
age        30
city       上海
hobby      足球
gender      女
Name: 1, dtype: object

列切片

In [15]:
user_info.iloc[1, 1:4]

age      30
city     上海
hobby    足球
Name: 1, dtype: object

In [16]:
user_info.iloc[1, [1, 3]]

age      30
hobby    足球
Name: 1, dtype: object

In [17]:
user_info.iloc[1, [1, 3]] = [32, "台球"]
user_info

    name  age city  hobby gender
0    Tom   20   北京     篮球      男
1    Bob   32   上海     台球      女
2   Mary   25   广州    羽毛球      女
3  James   40   深圳  读书；国学      男
4  Yafei  100   晋城  篮球；修己      女

行切片

In [18]:
user_info.iloc[1:4, 1]

1    32
2    25
3    40
Name: age, dtype: int64

In [19]:
user_info.iloc[[1, 3], 1]

1    32
3    40
Name: age, dtype: int64

In [20]:
user_info.iloc[[1, 2], 1] = [33, 44]
user_info

    name  age city  hobby gender
0    Tom   20   北京     篮球      男
1    Bob   33   上海     台球      女
2   Mary   44   广州    羽毛球      女
3  James   40   深圳  读书；国学      男
4  Yafei  100   晋城  篮球；修己      女

行列切片

In [21]:
user_info.iloc[1:4, 1:3]

   age city
1   33   上海
2   44   广州
3   40   深圳

In [22]:
user_info.iloc[1:4, 1:3] = [[33, "上海"], [50, "广州"], [40, "深圳"]]
user_info

    name  age city  hobby gender
0    Tom   20   北京     篮球      男
1    Bob   33   上海     台球      女
2   Mary   50   广州    羽毛球      女
3  James   40   深圳  读书；国学      男
4  Yafei  100   晋城  篮球；修己      女

访问单元

In [23]:
user_info.iloc[0, 1]

20

In [24]:
user_info.iloc[0, 1] = 25
user_info

    name  age city  hobby gender
0    Tom   25   北京     篮球      男
1    Bob   33   上海     台球      女
2   Mary   50   广州    羽毛球      女
3  James   40   深圳  读书；国学      男
4  Yafei  100   晋城  篮球；修己      女

## `loc[row, col]` 标签访问及修改

访问行数据

In [25]:
user_info.loc[0]

name      Tom
age        25
city       北京
hobby      篮球
gender      男
Name: 0, dtype: object

In [26]:
user_info.loc[1, :]

name      Bob
age        33
city       上海
hobby      台球
gender      女
Name: 1, dtype: object

访问列数据

In [27]:
user_info.loc[:, "city"]

0    北京
1    上海
2    广州
3    深圳
4    晋城
Name: city, dtype: object

In [28]:
user_info.loc[:, "age"] = [20, 30, 25, 20, 1]
user_info

    name  age city  hobby gender
0    Tom   20   北京     篮球      男
1    Bob   30   上海     台球      女
2   Mary   25   广州    羽毛球      女
3  James   20   深圳  读书；国学      男
4  Yafei    1   晋城  篮球；修己      女

行切片

In [29]:
user_info.loc[1:3, "city"]

1    上海
2    广州
3    深圳
Name: city, dtype: object

In [30]:
user_info.loc[1:3, :]

    name  age city  hobby gender
1    Bob   30   上海     台球      女
2   Mary   25   广州    羽毛球      女
3  James   20   深圳  读书；国学      男

In [31]:
user_info.loc[[1, 3]]

    name  age city  hobby gender
1    Bob   30   上海     台球      女
3  James   20   深圳  读书；国学      男

In [32]:
user_info.loc[[1, 3], "city"]

1    上海
3    深圳
Name: city, dtype: object

In [33]:
user_info.loc[[1, 3], "age"] = [10, 20]
user_info

    name  age city  hobby gender
0    Tom   20   北京     篮球      男
1    Bob   10   上海     台球      女
2   Mary   25   广州    羽毛球      女
3  James   20   深圳  读书；国学      男
4  Yafei    1   晋城  篮球；修己      女

列切片

In [34]:
user_info.loc[:, ['name', 'age']]

    name  age
0    Tom   20
1    Bob   10
2   Mary   25
3  James   20
4  Yafei    1

In [35]:
user_info.loc[0, ['name', 'age']]

name    Tom
age      20
Name: 0, dtype: object

In [36]:
user_info.loc[0, ['name', 'age']] = ["Tom", 30]
user_info

    name  age city  hobby gender
0    Tom   30   北京     篮球      男
1    Bob   10   上海     台球      女
2   Mary   25   广州    羽毛球      女
3  James   20   深圳  读书；国学      男
4  Yafei    1   晋城  篮球；修己      女

In [37]:
user_info.loc[:, user_info.columns[[0, 1]]]

    name  age
0    Tom   30
1    Bob   10
2   Mary   25
3  James   20
4  Yafei    1

In [38]:
user_info.loc[:, user_info.columns[1:3]]

   age city
0   30   北京
1   10   上海
2   25   广州
3   20   深圳
4    1   晋城

行列切片

In [39]:
user_info.loc[1:3, ["name", "city"]]

    name city
1    Bob   上海
2   Mary   广州
3  James   深圳

In [40]:
user_info.loc[[1, 3], ["name", "age"]]

    name  age
1    Bob   10
3  James   20

In [41]:
user_info.loc[[1, 3], ["name", "age"]] = [["Bob", 20], ["James", 20]]
user_info

    name  age city  hobby gender
0    Tom   30   北京     篮球      男
1    Bob   20   上海     台球      女
2   Mary   25   广州    羽毛球      女
3  James   20   深圳  读书；国学      男
4  Yafei    1   晋城  篮球；修己      女

条件选择

In [42]:
user_info.loc[(user_info.age < 30) & (user_info.gender == "女")]

    name  age city  hobby gender
1    Bob   20   上海     台球      女
2   Mary   25   广州    羽毛球      女
4  Yafei    1   晋城  篮球；修己      女

In [43]:
user_info.loc[(user_info.age < 30) & (user_info.gender == "女"), ['name', 'age']]

    name  age
1    Bob   20
2   Mary   25
4  Yafei    1

In [44]:
mask = (user_info.age < 30) & (user_info.gender == "女")
user_info.loc[mask, ['name', 'city']]

    name city
1    Bob   上海
2   Mary   广州
4  Yafei   晋城

In [45]:
mask = (user_info.age < 30) & (user_info.gender == "女")
user_info.loc[mask]

    name  age city  hobby gender
1    Bob   20   上海     台球      女
2   Mary   25   广州    羽毛球      女
4  Yafei    1   晋城  篮球；修己      女

新增一行

In [46]:
user_info.loc[user_info.index.max()+1] = ["Tony", 40, "苏州", "画画", "女"]
user_info

    name  age city  hobby gender
0    Tom   30   北京     篮球      男
1    Bob   20   上海     台球      女
2   Mary   25   广州    羽毛球      女
3  James   20   深圳  读书；国学      男
4  Yafei    1   晋城  篮球；修己      女
5   Tony   40   苏州     画画      女

In [47]:
# NOTE: https://stackoverflow.com/questions/19365513/how-to-add-an-extra-row-to-a-pandas-dataframe
user_info.loc[len(user_info)] = ["Tony", 40, "苏州", "画画", "女"]
user_info

    name  age city  hobby gender
0    Tom   30   北京     篮球      男
1    Bob   20   上海     台球      女
2   Mary   25   广州    羽毛球      女
3  James   20   深圳  读书；国学      男
4  Yafei    1   晋城  篮球；修己      女
5   Tony   40   苏州     画画      女
6   Tony   40   苏州     画画      女